docs: use mermaid
